In [3]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find the data files in the README.

In [7]:
titles = pd.read_csv('/Users/mitchellpalmer/Projects/Lighthouse Lab Projects/Python Practices/Pandas/Pandas_exercise/data/imdb_pandas/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [8]:
cast = pd.read_csv('/Users/mitchellpalmer/Projects/Lighthouse Lab Projects/Python Practices/Pandas/Pandas_exercise/data/imdb_pandas/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### 1. How many movies have the title "Hamlet"?

In [16]:
titles[titles['title'] == 'Hamlet'].shape[0]

18

### 2. When was the first movie titled "Hamlet" made?

In [29]:
titles[titles['title'] == 'Hamlet'].sort_values(by='year').head(1)

        title  year
46721  Hamlet  1910

### 3. How many movies were made in the year 1950?

In [31]:
titles[titles['year'] == 1950].shape[0]

1099

In [32]:
titles[titles['year'] == 1950]

                             title  year
71                Campo O' Donnell  1950
90                Botta e risposta  1950
233                         Madari  1950
552            Un certain monsieur  1950
1004             Vom Teufel gejagt  1950
...                            ...   ...
230617  Na Zha da zhan Hong Hai Er  1950
231254                Dwie brygady  1950
231404                       Jogan  1950
231936                Rasuna valea  1950
232004            Thyella sto faro  1950

[1099 rows x 2 columns]

### 4. How many movies were made from 1950 through 1959?

In [45]:
pd.merge(titles[titles['year'] >= 1950] , titles[titles['year'] <= 1959]).count()

title    12711
year     12711
dtype: int64

In [46]:
# more effeicent method

titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)].shape[0]

12711

### 5. In what years has a movie titled "Batman" been released?

In [48]:
titles[titles['title'] == 'Batman']['year']

56000    1989
74608    1943
Name: year, dtype: int64

In [50]:
# cleaner output

titles[titles['title'] == 'Batman']['year'].sort_values().tolist()

[1943, 1989]

### 6. How many roles were there in the movie "Inception"?

In [51]:
cast

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3634462,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3634463,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3634464,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3634465,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3634466,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

In [61]:
cast[cast['title'] == 'Inception'].count()

title        77
year         77
name         77
type         77
character    77
n            51
dtype: int64

In [62]:
# cleaner output / remember .shape[]

cast[cast['title'] == 'Inception'].shape[0]

77

### 7. How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [72]:
cast[cast['title'] == 'Inception']['n'].isnull().sum()

np.int64(26)

### 8. How many roles were credited in the silent 1921 version of Hamlet?

> Hint: There are a lot of "Hamlet" films, we want 1921 only

In [93]:
cast[ (cast['title'] == 'Hamlet') & (cast['year'] == 1921) ]

          title  year                    name     type         character    n
7488     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
444994   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
538568   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1102007  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
2119366  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2303412  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2578993  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
2954242  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
3229662  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

In [95]:
cast[ (cast['title'] == 'Hamlet') & (cast['year'] == 1921) ].shape[0]

9

### 9. Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [134]:
cast[ (cast['title'] == 'North by Northwest') & (cast['n'].notna())] .sort_values(by='n')

,title,year,name,type,character,n
845516,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3382934,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1413409,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3043261,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
345822,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
2941468,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1644542,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1236791,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2372617,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1757154,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
646039,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2225858,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
450691,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1463316,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
199768,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1343025,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### 10. Display the entire cast, in "n"-order, of the 1972 film "Sleuth". 

> Hint: There is more than one movie titled "Sleuth", we want 1972 only

In [126]:
cast [ (cast['title'] == 'Sleuth') & (cast['year'] == 1972)] . sort_values(by='n')

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### 11. How many people have played an "Ophelia"?

In [127]:
cast[ cast['character'] == 'Ophelia'].shape[0]

111

In [128]:
cast[ cast['character'] == 'Ophelia']

,title,year,name,type,character,n
240366,The Merry Maids of Madness,2016,Amy Bourque,actor,Ophelia,11.0
397692,Jake Gets Paid,2009,Josie Chisholm,actor,Ophelia,NaN
456673,Inoperable,2016,Crystal Cordero,actor,Ophelia,NaN
840572,"Dogg's Hamlet, Cahoot's Macbeth",2005,Lucas Grabeel,actor,Ophelia,NaN
1323306,11,2014,Catherine (IV) Lord,actor,Ophelia,NaN
...,...,...,...,...,...,...
3561046,"Hamlet, Son of a Kingpin",2015,Ingrid Vollset,actress,Ophelia,NaN
3574490,D.C. Cab,1983,Marsha Warfield,actress,Ophelia,7.0
3575192,Creature,2011,Jennifer Lynn Warren,actress,Ophelia,12.0
3585205,Hamlet,2015,Katie (II) West,actress,Ophelia,7.0
3601799,Hamlet,1996,Kate Winslet,actress,Ophelia,46.0

### 12. How many roles has Sidney Poitier played throughout his career?

In [131]:
cast[ cast['name'] == 'Sidney Poitier'].shape[0]

43

In [132]:
cast[ cast['name'] == 'Sidney Poitier'].head(10)

,title,year,name,type,character,n
1761853,A Patch of Blue,1965,Sidney Poitier,actor,Gordon Ralfe,1.0
1761854,A Piece of the Action,1977,Sidney Poitier,actor,Manny Durrell,1.0
1761855,A Raisin in the Sun,1961,Sidney Poitier,actor,Walter Lee Younger,1.0
1761856,A Warm December,1973,Sidney Poitier,actor,Dr. Matt Younger,1.0
1761857,All the Young Men,1960,Sidney Poitier,actor,Sgt. Eddie Towler,2.0
1761858,Band of Angels,1957,Sidney Poitier,actor,Rau-Ru,3.0
1761859,Blackboard Jungle,1955,Sidney Poitier,actor,Gregory W. Miller,10.0
1761860,Brother John,1971,Sidney Poitier,actor,John Kane,1.0
1761861,Buck and the Preacher,1972,Sidney Poitier,actor,Buck,1.0
1761862,"Cry, the Beloved Country",1951,Sidney Poitier,actor,Reverend Msimangu,3.0

### 13. List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [141]:
cast[ (cast['name'] == 'Cary Grant') & (cast['n'] == 2) & (cast['year'] >= 1940) & (cast['year'] < 1950)].sort_values(by='year')

                   title  year        name   type    character    n
845513  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
845523    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

In [143]:
# more effiecient

cast[ (cast['name'] == 'Cary Grant') & (cast['n'] == 2) & (cast['year'].between(1940,1949))].sort_values(by='year')

                   title  year        name   type    character    n
845513  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
845523    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### 14. How many roles were avilable for actresses in the 1950s?

In [151]:
cast[ (cast['type'] == 'actress') & (cast['year'].between(1950,1959))].sort_values(by='year').shape[0]

56412

### 15. How many leading roles (n=1) were available from the beginning of film history through 1980?

In [154]:
cast [ (cast['n'] == 1) & (cast['year'] <= 1980)].sort_values(by='year').shape[0]

64095

### 16. Which three years in the 1930s saw the most films released?

In [166]:
titles['decade'] = titles['year'] // 10 * 10

titles

                                       title  year  decade
0                             The Rising Son  1990    1990
1                    The Thousand Plane Raid  1969    1960
2                           Crucea de piatra  1993    1990
3                                    Country  2000    2000
4                                 Gaiking II  2011    2010
...                                      ...   ...     ...
232325                                 E yue  2005    2000
232326                          Lakota Girls  2015    2010
232327                        Kroniki domowe  1997    1990
232328                  Awakening the Zodiac  2017    2010
232329  Death in the Valley of Good and Evil  2018    2010

[232330 rows x 3 columns]

In [173]:
titles[ titles['decade'] == 1930].groupby('year').size().sort_values(ascending=False).head(3)

year
1937    1196
1936    1138
1938    1129
dtype: int64

### 17. Count the number of "Hamlet" films made in each decade.

> Hint: You can use the same approach to finding the decade as you did in `01-Accessing`

In [179]:
(titles[ titles['title'] == 'Hamlet']
    .groupby('decade')
    .size().
    sort_values()
)

decade
1920    1
1940    1
1950    1
1980    1
1960    2
1970    2
1990    2
2000    2
1910    3
2010    3
dtype: int64

In [186]:
cast

,title,year,name,type,character,n
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN
...,...,...,...,...,...,...
3634462,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0
3634463,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0
3634464,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0
3634465,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0
3634466,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN

### 18. Count the number of "Rustler" characters in each decade of the history of film.

In [188]:

cast['decade'] = cast['year'] // 10 * 10

cast

,title,year,name,type,character,n,decade
0,Closet Monster,2015,Buffy #1,actor,Buffy 4,NaN,2010
1,Suuri illusioni,1985,Homo $,actor,Guests,22.0,1980
2,Battle of the Sexes,2017,$hutter,actor,Bobby Riggs Fan,10.0,2010
3,Secret in Their Eyes,2015,$hutter,actor,2002 Dodger Fan,NaN,2010
4,Steve Jobs,2015,$hutter,actor,1988 Opera House Patron,NaN,2010
...,...,...,...,...,...,...,...
3634462,Foxtrot,1988,Lilja ??risd?ttir,actress,D?ra,24.0,1980
3634463,Niceland (Population. 1.000.002),2004,Sigr??ur J?na ??risd?ttir,actress,Woman in Bus,26.0,2000
3634464,Skammdegi,1985,Dalla ??r?ard?ttir,actress,Hj?krunarkona,9.0,1980
3634465,U.S.S.S.S...,2003,Krist?n Andrea ??r?ard?ttir,actress,Afgr.dama ? bens?nst??,17.0,2000
3634466,Bye Bye Blue Bird,1999,Rosa ? R?gvu,actress,Pensionatv?rtinde,NaN,1990

In [189]:
(
    cast[ cast['character'] == 'Rustler'].groupby('decade').size()
)

decade
1920     6
1930    84
1940    18
1950     8
1960     2
1970     9
1980     1
1990     4
2000     2
dtype: int64

### 19. Who are the 10 people most often credited as "Herself" in film history?

In [195]:
cast [ cast['character'] == 'Herself'].groupby('name').size().sort_values(ascending=False).head(10)

name
Queen Elizabeth II    11
Joyce Brothers         9
Margaret Thatcher      8
Hillary Clinton        7
Mary Jo Pehl           7
Joan Rivers            6
Sumie Sakai            6
Bunny Yeager           5
Kareena Kapoor         5
Rekha                  5
dtype: int64

### 20. Which actors or actresses appeared in the most movies in the year 1945?

In [198]:
cast [ cast['year'] == 1945].groupby('name').size().sort_values(ascending=False).head(1)

name
Emmett Vogan    39
dtype: int64

### 21. What are the 10 most frequent roles that start with the phrase "Patron in"?

In [209]:
# SQL's % wildcard not applicablein Pandas Python
# .str to address string characters, then available methods
# in this situation, .startswith
cast [ cast['character'].str.startswith('Patron in', na=False)]

,title,year,name,type,character,n,decade
20628,Let It Ride,1989,Ralph Ahn,actor,Patron in Chinese Restaurant,43.0,1980
23776,Alex Cross,2012,Anthony Akins,actor,Patron in restaurant,NaN,2010
25314,Missing Pieces,2012,Rico Alago,actor,Patron in Restaurant,NaN,2010
30163,The Black Bird,1975,John Alderman,actor,Patron in Ballroom,NaN,1970
32347,Sparkle,2012,Eligah Alexander Jr.,actor,Patron in Audience,NaN,2010
...,...,...,...,...,...,...,...
3293566,Above Suspicion,1943,Nita Pike,actress,Patron in Frisky Rabbit,NaN,1940
3300726,Crashing,2007,Sachi Pollard,actress,Patron in the Coffee House,56.0,2000
3513392,Crashing,2007,Talia Tinari,actress,Patron in the Coffee House,57.0,2000
3515061,Breaking the Press,2010,Michelle Toche,actress,Patron in restaurant,NaN,2010
3529675,Let It Ride,1989,Myra Turley,actress,Patron in Chinese Restaurant,37.0,1980

In [212]:
(cast [ cast['character'].str.startswith('Patron in', na=False)]
    .groupby('character')
    .size()
    .sort_values(ascending=False)
    .head(10)
 
)

character
Patron in Frisky Rabbit         16
Patron in Chinese Restaurant     9
Patron in the Coffee House       9
Patron in Billiard Parlor        5
Patron in Bar                    4
Patron in restaurant             4
Patron in Club                   3
Patron in Restaurant             3
Patron in cabaret                3
Patron in Audience               2
dtype: int64

### 22. Count number of n-values of the roles that Judi Dench has played over her career.

In [218]:
(
    cast[ cast['name'] == 'Judi Dench']
        .groupby('n')
        .size()
)

n
1.0     6
2.0     6
3.0     6
4.0     4
5.0     2
6.0     4
7.0     4
8.0     1
9.0     1
12.0    3
13.0    2
16.0    2
18.0    2
20.0    1
23.0    1
26.0    1
29.0    1
40.0    1
dtype: int64

### 23. How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [220]:
(
    cast[ (cast['n'] == 1) & (cast['year'].between(1950,1959))]
        .groupby('type')
        .size()
)

type
actor      6616
actress    2965
dtype: int64

In [223]:
# Readable formatting

gender_roles_1950 = (
    cast[ (cast['n'] == 1) & (cast['year'].between(1950,1959))]
        .groupby('type')
        .size()
        .reset_index(name='leading_roles')
)

display(gender_roles_1950)

      type  leading_roles
0    actor           6616
1  actress           2965

## Pandas vs SQL

For Pandas, the dataframe is filtered based on the condition and then the
desired columns and rows are selected.

churn[churn.Geography == 'France'][['CustomerId','Geography']][:5]

churn[['Geography','Age']].groupby('Geography').mean()\
.sort_values(by='Age', ascending=False)